
import { 提示词结构 } from '../../types';

export const 难度_生理: 提示词结构[] = [
    {
        id: 'diff_phys_relaxed',
        标题: '生理难度：轻松',
        内容: `无需进食饮水，免疫所有疾病与毒素。`,
        类型: '难度设定',
        启用: false
    },
    {
        id: 'diff_phys_easy',
        标题: '生理难度：简单',
        内容: `饥饿与口渴消耗速度减半，不易生病。`,
        类型: '难度设定',
        启用: false
    },
    {
        id: 'diff_phys_normal',
        标题: '生理难度：正常',
        内容: `正常的新陈代谢速度。`,
        类型: '难度设定',
        启用: true
    },
    {
        id: 'diff_phys_hard',
        标题: '生理难度：困难',
        内容: `消耗加快，容易患病，伤口若不处理会感染。`,
        类型: '难度设定',
        启用: false
    },
    {
        id: 'diff_phys_extreme',
        标题: '生理难度：极限',
        内容: `极易饥渴，伤口极易感染致死，开局带有随机残疾。`,
        类型: '难度设定',
        启用: false
    }
];
